<a href="https://colab.research.google.com/github/4060E046/AI_and_security/blob/master/10_minutes_to_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Creating a Series by passing a list of values, letting pandas create a default integer index:**

In [3]:
import numpy as np
import pandas as pd
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

**Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns:**

In [4]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.940202  0.096039  0.396034  0.616136
2013-01-02 -1.653035  0.019699 -0.058005 -0.572179
2013-01-03  2.121110  2.748939 -0.537573 -0.679182
2013-01-04  0.835993 -0.493678 -0.234260  1.735533
2013-01-05  0.805887  1.805297  2.612329  0.612783
2013-01-06  0.505139  0.316626  0.755513 -0.307437

**Creating a DataFrame by passing a dict of objects that can be converted to series-like.**

In [7]:
df2 = pd.DataFrame({'A': 1.,
           'B': pd.Timestamp('20201012'),
           'C': pd.Series(1, index=list(range(4)), dtype='float32'),
           'D': np.array([3] * 4, dtype='int32'),
           'E': pd.Categorical(["test", "train", "test", "train"]),
           'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2020-10-12  1.0  3   test  foo
1  1.0 2020-10-12  1.0  3  train  foo
2  1.0 2020-10-12  1.0  3   test  foo
3  1.0 2020-10-12  1.0  3  train  foo

**The columns of the resulting DataFrame have different dtypes.**

In [8]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

**Viewing data**

**Here is how to view the top and bottom rows of the frame:**

In [12]:
df.head()

                   A         B         C         D
2013-01-01  0.940202  0.096039  0.396034  0.616136
2013-01-02 -1.653035  0.019699 -0.058005 -0.572179
2013-01-03  2.121110  2.748939 -0.537573 -0.679182
2013-01-04  0.835993 -0.493678 -0.234260  1.735533
2013-01-05  0.805887  1.805297  2.612329  0.612783

**Display the index, columns:**

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

**For df, our DataFrame of all floating-point values, DataFrame.to_numpy() is fast and doesn’t require copying data.**

In [15]:
df.to_numpy()

array([[ 0.94020172,  0.0960394 ,  0.39603374,  0.61613586],
       [-1.6530349 ,  0.01969858, -0.0580049 , -0.57217887],
       [ 2.12111014,  2.74893884, -0.53757281, -0.67918217],
       [ 0.83599277, -0.49367786, -0.23425996,  1.73553347],
       [ 0.80588693,  1.80529721,  2.61232879,  0.61278282],
       [ 0.50513863,  0.31662563,  0.75551279, -0.30743729]])

**For df2, the DataFrame with multiple dtypes, DataFrame.to_numpy() is relatively expensive.**

In [16]:
df2.to_numpy()

array([[1.0, Timestamp('2020-10-12 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2020-10-12 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2020-10-12 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2020-10-12 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

**describe() shows a quick statistic summary of your data:**

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.592549  0.748820  0.489006  0.234276
std    1.233890  1.249396  1.137046  0.929633
min   -1.653035 -0.493678 -0.537573 -0.679182
25%    0.580326  0.038784 -0.190196 -0.505993
50%    0.820940  0.206333  0.169014  0.152673
75%    0.914149  1.433129  0.665643  0.615298
max    2.121110  2.748939  2.612329  1.735533

**Transposing your data:**

In [18]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.940202   -1.653035    2.121110    0.835993    0.805887    0.505139
B    0.096039    0.019699    2.748939   -0.493678    1.805297    0.316626
C    0.396034   -0.058005   -0.537573   -0.234260    2.612329    0.755513
D    0.616136   -0.572179   -0.679182    1.735533    0.612783   -0.307437

**Sorting by an axis:**

In [19]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.616136  0.396034  0.096039  0.940202
2013-01-02 -0.572179 -0.058005  0.019699 -1.653035
2013-01-03 -0.679182 -0.537573  2.748939  2.121110
2013-01-04  1.735533 -0.234260 -0.493678  0.835993
2013-01-05  0.612783  2.612329  1.805297  0.805887
2013-01-06 -0.307437  0.755513  0.316626  0.505139

**Sorting by values:**

In [20]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04  0.835993 -0.493678 -0.234260  1.735533
2013-01-02 -1.653035  0.019699 -0.058005 -0.572179
2013-01-01  0.940202  0.096039  0.396034  0.616136
2013-01-06  0.505139  0.316626  0.755513 -0.307437
2013-01-05  0.805887  1.805297  2.612329  0.612783
2013-01-03  2.121110  2.748939 -0.537573 -0.679182

**Getting**

**Selecting a single column, which yields a Series, equivalent to df.A:**

In [21]:
df['A']

2013-01-01    0.940202
2013-01-02   -1.653035
2013-01-03    2.121110
2013-01-04    0.835993
2013-01-05    0.805887
2013-01-06    0.505139
Freq: D, Name: A, dtype: float64

**Selecting via [], which slices the rows.**

In [22]:
df[0:3]

                   A         B         C         D
2013-01-01  0.940202  0.096039  0.396034  0.616136
2013-01-02 -1.653035  0.019699 -0.058005 -0.572179
2013-01-03  2.121110  2.748939 -0.537573 -0.679182

In [23]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.653035  0.019699 -0.058005 -0.572179
2013-01-03  2.121110  2.748939 -0.537573 -0.679182
2013-01-04  0.835993 -0.493678 -0.234260  1.735533

**Selection by label**

**For getting a cross section using a label:**

In [24]:
df.loc[dates[0]]

A    0.940202
B    0.096039
C    0.396034
D    0.616136
Name: 2013-01-01 00:00:00, dtype: float64

**Selecting on a multi-axis by label:**

In [25]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.940202  0.096039
2013-01-02 -1.653035  0.019699
2013-01-03  2.121110  2.748939
2013-01-04  0.835993 -0.493678
2013-01-05  0.805887  1.805297
2013-01-06  0.505139  0.316626

**Showing label slicing, both endpoints are included:**

In [26]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -1.653035  0.019699
2013-01-03  2.121110  2.748939
2013-01-04  0.835993 -0.493678

**Reduction in the dimensions of the returned object:**

In [27]:
df.loc['20130102', ['A', 'B']]

A   -1.653035
B    0.019699
Name: 2013-01-02 00:00:00, dtype: float64

**For getting a scalar value:**

In [28]:
df.loc[dates[0], 'A']

0.9402017238810867

**For getting fast access to a scalar (equivalent to the prior method):**

In [29]:
df.at[dates[0], 'A']

0.9402017238810867

**Selection by position**

**Select via the position of the passed integers:**

In [30]:
df.iloc[3]

A    0.835993
B   -0.493678
C   -0.234260
D    1.735533
Name: 2013-01-04 00:00:00, dtype: float64

**By integer slices, acting similar to numpy/python:**

In [31]:
 df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.835993 -0.493678
2013-01-05  0.805887  1.805297

**By lists of integer position locations, similar to the numpy/python style:**

In [32]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -1.653035 -0.058005
2013-01-03  2.121110 -0.537573
2013-01-05  0.805887  2.612329

**For slicing rows explicitly:**

In [33]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -1.653035  0.019699 -0.058005 -0.572179
2013-01-03  2.121110  2.748939 -0.537573 -0.679182

**For slicing columns explicitly:**

In [34]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.096039  0.396034
2013-01-02  0.019699 -0.058005
2013-01-03  2.748939 -0.537573
2013-01-04 -0.493678 -0.234260
2013-01-05  1.805297  2.612329
2013-01-06  0.316626  0.755513

**For getting a value explicitly:**

In [35]:
df.iloc[1, 1]

0.019698578912221255

**For getting fast access to a scalar (equivalent to the prior method):**

In [36]:
df.iat[1, 1]

0.019698578912221255

**Boolean indexing**

**Using a single column’s values to select data.**

In [37]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-01  0.940202  0.096039  0.396034  0.616136
2013-01-03  2.121110  2.748939 -0.537573 -0.679182
2013-01-04  0.835993 -0.493678 -0.234260  1.735533
2013-01-05  0.805887  1.805297  2.612329  0.612783
2013-01-06  0.505139  0.316626  0.755513 -0.307437

**Selecting values from a DataFrame where a boolean condition is met.**

In [38]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.940202  0.096039  0.396034  0.616136
2013-01-02       NaN  0.019699       NaN       NaN
2013-01-03  2.121110  2.748939       NaN       NaN
2013-01-04  0.835993       NaN       NaN  1.735533
2013-01-05  0.805887  1.805297  2.612329  0.612783
2013-01-06  0.505139  0.316626  0.755513       NaN

**Using the isin() method for filtering:**

In [39]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.940202  0.096039  0.396034  0.616136    one
2013-01-02 -1.653035  0.019699 -0.058005 -0.572179    one
2013-01-03  2.121110  2.748939 -0.537573 -0.679182    two
2013-01-04  0.835993 -0.493678 -0.234260  1.735533  three
2013-01-05  0.805887  1.805297  2.612329  0.612783   four
2013-01-06  0.505139  0.316626  0.755513 -0.307437  three

In [40]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  2.121110  2.748939 -0.537573 -0.679182   two
2013-01-05  0.805887  1.805297  2.612329  0.612783  four

**Setting**

**Setting a new column automatically aligns the data by the indexes.**

In [41]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [42]:
df['F'] = s1

**Setting values by label:**

In [43]:
df.at[dates[0], 'A'] = 0

**Setting values by position:**

In [44]:
df.iat[0, 1] = 0

**Setting by assigning with a NumPy array:**

In [45]:
 df.loc[:, 'D'] = np.array([5] * len(df))

**The result of the prior setting operations.**

In [46]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.396034  5  NaN
2013-01-02 -1.653035  0.019699 -0.058005  5  1.0
2013-01-03  2.121110  2.748939 -0.537573  5  2.0
2013-01-04  0.835993 -0.493678 -0.234260  5  3.0
2013-01-05  0.805887  1.805297  2.612329  5  4.0
2013-01-06  0.505139  0.316626  0.755513  5  5.0

**A where operation with setting.**

In [47]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.396034 -5  NaN
2013-01-02 -1.653035 -0.019699 -0.058005 -5 -1.0
2013-01-03 -2.121110 -2.748939 -0.537573 -5 -2.0
2013-01-04 -0.835993 -0.493678 -0.234260 -5 -3.0
2013-01-05 -0.805887 -1.805297 -2.612329 -5 -4.0
2013-01-06 -0.505139 -0.316626 -0.755513 -5 -5.0

**Missing data**

**Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.**

In [48]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.396034  5  NaN  1.0
2013-01-02 -1.653035  0.019699 -0.058005  5  1.0  1.0
2013-01-03  2.121110  2.748939 -0.537573  5  2.0  NaN
2013-01-04  0.835993 -0.493678 -0.234260  5  3.0  NaN

**To drop any rows that have missing data.**

In [49]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -1.653035  0.019699 -0.058005  5  1.0  1.0

**Filling missing data.**

In [50]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.396034  5  5.0  1.0
2013-01-02 -1.653035  0.019699 -0.058005  5  1.0  1.0
2013-01-03  2.121110  2.748939 -0.537573  5  2.0  5.0
2013-01-04  0.835993 -0.493678 -0.234260  5  3.0  5.0

**To get the boolean mask where values are nan.**

In [51]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True